#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/matheuscscp/splitwiser/runs/run-23MRrBg3MzNhbU3N

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudfunctions_function.start-bot will be created
  + resource "google_cloudfunctions_function" "start-bot" {
      + available_memory_mb           = 256
      + description                   = "HTTPS function to trigger the bot via Cloud Pub/Sub"
      + docker_registry               = (known after apply)
      + environment_variables         = {
          + "PROJECT_ID" = "splitwiser-356519"
          + "TOPIC_ID"   = "start-bot"
        }
      + https_trigger_security_level  = "SECURE_ALWAYS"
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 0
      + name                          = "StartBot"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "go116"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = "start-bot-archive"
      + source_archive_object         = "index.zip"
      + timeout                       = 60
      + trigger_http                  = true
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }

      + secret_environment_variables {
          + key        = "TOKEN"
          + project_id = (known after apply)
          + secret     = "start-bot-token"
          + version    = "latest"
        }
    }

  # google_cloudfunctions_function_iam_member.invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "invoker" {
      + cloud_function = "StartBot"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_project_iam_member.start-bot-secret-accessor will be created
  + resource "google_project_iam_member" "start-bot-secret-accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "splitwiser-356519"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_pubsub_topic.start-bot will be created
  + resource "google_pubsub_topic" "start-bot" {
      + id      = (known after apply)
      + name    = "start-bot"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_service_account.start-bot will be created
  + resource "google_service_account" "start-bot" {
      + account_id   = "start-bot-cloud-function"
      + disabled     = false
      + display_name = "StartBot Cloud Function"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.start-bot-archive will be created
  + resource "google_storage_bucket" "start-bot-archive" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "start-bot-archive"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.start-bot-archive will be created
  + resource "google_storage_bucket_object" "start-bot-archive" {
      + bucket         = "start-bot-archive"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "index.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./index.zip"
      + storage_class  = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.



```
*Pushed by: @matheuscscp, Action: `pull_request`*